# https://projecteuler.net/problem=45
# Triangle, pentagonal, and hexagonal numbers are generated by the following formulae:
# Triangle
# Tₙ=n(n+1)/2
# 1, 3, 6, 10, 15, ...
# Pentagonal
# Pₙ=n(3n−1)/2
# 1, 5, 12, 22, 35, ...
# Hexagonal
# Hₙ=n(2n−1)
# 1, 6, 15, 28, 45, ...
# It can be verified that T₂₈₅ = P₁₆₅ = H₁₄₃ = 40755.
# Find the next triangle number that is also pentagonal and hexagonal.
#
# https://euler.jakumo.org/problems/view/45.html
# Треугольные, пятиугольные и шестиугольные числа вычисляются по нижеследующим формулам:
# Треугольные
# Tₙ=n(n+1)/2
# 1, 3, 6, 10, 15, ...
# Пятиугольные
# Pₙ=n(3n−1)/2
# 1, 5, 12, 22, 35, ...
# Шестиугольные
# Hₙ=n(2n−1)
# 1, 6, 15, 28, 45, ...
# Можно убедиться в том, что T₂₈₅ = P₁₆₅ = H₁₄₃ = 40755.
# Найдите следующее треугольное число, являющееся также пятиугольным и шестиугольным.
#
# 1533776805

import time

start_time = time.time()


def p(n):
    return int(n * (3 * n - 1) / 2)


def h(n):
    return n * (2 * n - 1)


i = 144
j = 166
found = False
while not found:
    h_i = h(i)
    i += 1
    while 1:
        p_j = p(j)
        if p_j < h_i:
            j += 1
        elif p_j > h_i:
            break
        else:
            found = True
            print(p_j)
            break

end_time = time.time()

print()
print('time:', end_time - start_time)
